
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>用户行为分析平台 · 大数据技术与算法Checklist</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="powerlee">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-advanced-emoji/emoji-website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-insert-logo/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-flexible-alerts/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-katex-new/katex.min.css">
                
            
                
                <link rel="stylesheet" href="https://unpkg.com/gitalk/dist/gitalk.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="SQLKeypoints.html" />
    
    
    <link rel="prev" href="DimensionalModeling.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="GradientDescent.html">
            
                <a href="GradientDescent.html">
            
                    
                    梯度下降
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="LinearRegression.html">
            
                <a href="LinearRegression.html">
            
                    
                    线性回归
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="LogisticRegression.md">
            
                <span>
            
                    
                    逻辑回归
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="HypothesisTesting.md">
            
                <span>
            
                    
                    A/B实验原理：假设检验
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ABTest.html">
            
                <a href="ABTest.html">
            
                    
                    A/B实验
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="TimeSeries.html">
            
                <a href="TimeSeries.html">
            
                    
                    时间序列
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="DimensionalModeling.html">
            
                <a href="DimensionalModeling.html">
            
                    
                    维度建模
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.9" data-path="UserBehaviorsAnalysisPlatform.html">
            
                <a href="UserBehaviorsAnalysisPlatform.html">
            
                    
                    用户行为分析平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="SQLKeypoints.html">
            
                <a href="SQLKeypoints.html">
            
                    
                    SQL要点
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="SQLCases.html">
            
                <a href="SQLCases.html">
            
                    
                    SQL案例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" >
            
                <span>
            
                    
                    附录
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.12.1" data-path="ProbabilityAndStatistics.html">
            
                <a href="ProbabilityAndStatistics.html">
            
                    
                    概率论与数理统计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12.2" data-path="GitCheatSheet.html">
            
                <a href="GitCheatSheet.html">
            
                    
                    Git Cheat Sheet
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >用户行为分析平台</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x51FA;&#x73B0;&#x5B8C;&#x5168;&#x662F;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x4EA7;&#x54C1;&#x7814;&#x53D1;&#x56E2;&#x961F;&#x5BF9;&#x6570;&#x636E;&#x5206;&#x6790;&#x7B80;&#x5355;&#x3001;&#x7075;&#x6D3B;&#x3001;&#x9AD8;&#x9891;&#x3001;&#x5FEB;&#x901F;&#x7684;&#x5B9E;&#x9645;&#x9700;&#x6C42;&#xFF0C;&#x76F4;&#x63A5;&#x9762;&#x5411;&#x6570;&#x636E;&#x9A71;&#x52A8;&#x3001;&#x589E;&#x957F;&#x8425;&#x9500;&#x3001;&#x667A;&#x80FD;&#x8FD0;&#x8425;&#x7684;&#x96C6;&#x6210;&#x6570;&#x636E;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4F20;&#x7EDF;&#x6570;&#x4ED3;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x5206;&#x5C42;&#x548C;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x5EFA;&#x6A21;&#x7684;&#x601D;&#x60F3;&#x867D;&#x7136;&#x4E5F;&#x6E90;&#x81EA;&#x7EF4;&#x5EA6;&#x5EFA;&#x6A21;&#xFF0C;&#x4F46;&#x5C06;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x4E86;&#x6781;&#x5927;&#x7684;&#x7B80;&#x5316;&#x3002;&#x964D;&#x4F4E;&#x4E86;&#x6570;&#x636E;&#x4F7F;&#x7528;&#x8005;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x7406;&#x89E3;&#x95E8;&#x69DB;&#x3002;&#x5728;&#x6570;&#x636E;&#x8D28;&#x91CF;&#x548C;&#x6570;&#x636E;&#x5B9E;&#x65F6;&#x6027;&#x4E0A;&#x4E5F;&#x56E0;&#x4E3A;&#x6A21;&#x578B;&#x672C;&#x8EAB;&#x7684;&#x7B80;&#x6D01;&#x5F97;&#x5230;&#x4E86;&#x6709;&#x6548;&#x7684;&#x4FDD;&#x8BC1;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4F20;&#x7EDF;BI&#xFF0C;&#x6570;&#x636E;&#x6E90;&#x76F8;&#x5BF9;&#x5206;&#x6563;&#xFF0C;&#x6570;&#x636E;&#x4F7F;&#x7528;&#x8FC7;&#x4E8E;&#x7075;&#x6D3B;&#xFF0C;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7EDF;&#x4E00;&#x4E86;&#x6570;&#x636E;&#x6765;&#x6E90;&#xFF08;&#x7EDF;&#x4E00;&#x7684;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x6570;&#x636E;&#x4E0A;&#x62A5;&#xFF09;&#xFF0C;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x4EA7;&#x54C1;&#x8FD0;&#x8425;&#x7814;&#x53D1;&#x56E2;&#x961F;&#x5BF9;&#x6570;&#x636E;&#x5206;&#x6790;&#x7684;&#x8981;&#x6C42;&#x63D0;&#x70BC;&#x51FA;&#x4E86;&#x6570;&#x636E;&#x7684;&#x7279;&#x5B9A;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#xFF08;&#x4E8B;&#x4EF6;&#x5206;&#x6790;&#xFF0C;&#x7559;&#x5B58;&#x5206;&#x6790;&#xFF0C;&#x6F0F;&#x6597;&#x5206;&#x6790;&#xFF0C;&#x5206;&#x5E03;&#x5206;&#x6790;&#xFF0C;&#x8DEF;&#x5F84;&#x5206;&#x6790;&#x7B49;&#x7B49;&#xFF09;&#x3002;&#x6E90;&#x81EA;&#x4EA7;&#x54C1;&#x8FD0;&#x8425;&#x7814;&#x53D1;&#x56E2;&#x961F;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x7684;&#x5206;&#x6790;&#x65B9;&#x6CD5;&#xFF0C;&#x81EA;&#x7136;&#x4F7F;&#x5F97;&#x4EA7;&#x54C1;&#x8FD0;&#x8425;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x65F6;&#x66F4;&#x52A0;&#x7684;&#x5F97;&#x5FC3;&#x5E94;&#x624B;&#xFF0C;&#x80FD;&#x591F;&#x5C06;&#x76EE;&#x5149;&#x805A;&#x7126;&#x4E8E;&#x5177;&#x4F53;&#x6570;&#x636E;&#x5206;&#x6790;&#x548C;&#x4F7F;&#x7528;&#x672C;&#x8EAB;&#x3002;</p>
<p>&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x4ECE;&#x6570;&#x636E;&#x4E0A;&#x62A5;&#x5230;&#x6570;&#x636E;&#x53EF;&#x7528;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x5206;&#x949F;&#x7EA7;&#x3002;&#x6570;&#x636E;&#x867D;&#x7136;&#x5E76;&#x975E;&#x5B9E;&#x65F6;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x6EE1;&#x8DB3;&#x4EA7;&#x54C1;&#x8FD0;&#x8425;&#x7814;&#x53D1;&#x56E2;&#x961F;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x5B8C;&#x5168;&#x6EE1;&#x8DB3;&#x6570;&#x636E;&#x9A71;&#x52A8;&#x7684;&#x8981;&#x6C42;&#x3002;&#x5BF9;&#x4E8E;&#x5206;&#x6790;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x5176;&#x5B9E;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x8FFD;&#x6C42;&#x5B9E;&#x65F6;&#xFF0C;&#x591F;&#x7528;&#x624D;&#x662F;&#x6700;&#x597D;&#x7684;&#xFF0C;&#x6CA1;&#x5FC5;&#x8981;&#x53BB;&#x627F;&#x62C5;&#x5B9E;&#x65F6;&#x7CFB;&#x7EDF;&#x7684;&#x9AD8;&#x6210;&#x672C;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x57FA;&#x4E8E;&#x79BB;&#x7EBF;&#x6570;&#x4ED3;&#x7684;&#x5929;&#x7EA7;&#x6570;&#x636E;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x9A71;&#x52A8;&#x7684;&#x56E2;&#x961F;&#x6765;&#x8BF4;&#x53C8;&#x5B8C;&#x5168;&#x4E0D;&#x591F;&#x3002;&#x91CF;&#x53D8;&#x5F15;&#x8D77;&#x8D28;&#x53D8;&#xFF0C;&#x53EA;&#x6709;&#x8DB3;&#x591F;&#x5FEB;&#x7684;&#x51FA;&#x56FE;&#x901F;&#x5EA6;&#x624D;&#x80FD;&#x8FBE;&#x5230;&#x8FDE;&#x8D2F;&#x7684;&#x6570;&#x636E;&#x601D;&#x7EF4;&#x3002;</p>
<p>&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x5B8C;&#x5168;&#x57FA;&#x4E8E;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x6570;&#x636E;&#x7684;&#x4E0A;&#x62A5;&#xFF0C;&#x5206;&#x6790;&#x7684;&#x4E5F;&#x662F;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x6570;&#x636E;&#x3002;&#x7F3A;&#x5931;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;&#x4E8E;&#x662F;&#x9488;&#x5BF9;&#x4E00;&#x4E9B;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x65E0;&#x6CD5;&#x6709;&#x6548;&#x5206;&#x6790;&#x3002;&#x4E0D;&#x8FC7;&#x4E0D;&#x65AD;&#x8FDB;&#x5316;&#x7684;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x81EA;&#x884C;&#x4E0A;&#x62A5;&#x4E00;&#x4E9B;&#x7EF4;&#x8868;&#x6570;&#x636E;&#x8865;&#x5145;&#x90E8;&#x5206;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x7684;&#x7F3A;&#x5931;&#x3002;&#x4F46;&#x4ECD;&#x7136;&#x7684;&#xFF0C;&#x4E00;&#x4E9B;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5E93;&#x76F8;&#x5173;&#x7684;&#x7D2F;&#x8BA1;&#x6570;&#x636E;&#x6216;&#x8005;&#x72B6;&#x6001;&#x6570;&#x636E;&#xFF0C;&#x5206;&#x6790;&#x8D77;&#x6765;&#x4ECD;&#x7136;&#x4E0D;&#x65B9;&#x4FBF;&#x3002;&#x4F46;&#x662F;&#x5269;&#x4E0B;&#x8FD9;&#x4E9B;&#x641E;&#x4E0D;&#x5B9A;&#x7684;&#x5206;&#x6790;&#x771F;&#x7684;&#x4E0D;&#x591A;&#x4E86;&#x3002;&#x53EA;&#x9700;&#x8981;&#x7A0D;&#x5FAE;&#x518D;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x505A;&#x4E00;&#x4E9B;BI&#x62A5;&#x8868;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x5C3D;&#x53EF;&#x80FD;&#x7528;&#x6700;&#x5C11;&#x7684;&#x8D44;&#x6E90;&#x6700;&#x4F4E;&#x7684;&#x6210;&#x672C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x903B;&#x8F91;&#x6700;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#x6EE1;&#x8DB3;&#x4EA7;&#x54C1;&#x8FD0;&#x8425;&#x7814;&#x53D1;&#x56E2;&#x961F;&#x6700;&#x591A;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#x9700;&#x6C42;&#x3002;&#x8BA9;&#x56E2;&#x961F;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x80FD;&#x8F7B;&#x677E;&#x73A9;&#x8F6C;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x5B83;&#x5DE8;&#x5927;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E2D;&#x5C0F;&#x516C;&#x53F8;&#xFF0C;&#x5982;&#x679C;&#x5F00;&#x59CB;&#x8003;&#x8651;&#x642D;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x4F53;&#x7CFB;&#xFF0C;&#x52A1;&#x5FC5;&#x4F18;&#x5148;&#x8003;&#x8651;&#x642D;&#x5EFA;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x3002;&#x5BF9;&#x4E8E;&#x4E2D;&#x5C0F;&#x516C;&#x53F8;&#x7684;&#x4E1A;&#x52A1;&#x4F53;&#x91CF;&#x800C;&#x8A00;&#xFF0C;&#x771F;&#x6B63;&#x53EF;&#x4EE5;&#x79F0;&#x4E4B;&#x4E3A;&#x5927;&#x6570;&#x636E;&#x7684;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x6570;&#x636E;&#xFF0C;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x603B;&#x4F53;&#x6765;&#x8BF4;&#x4E0D;&#x4F1A;&#x592A;&#x5927;&#xFF0C;&#x8FD9;&#x5C31;&#x66F4;&#x51F8;&#x663E;&#x4E86;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x5E02;&#x9762;&#x4E0A;&#x4E5F;&#x6709;&#x7740;&#x4E00;&#x6279;&#x4F18;&#x79C0;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x516C;&#x53F8;&#x63D0;&#x4F9B;&#x57FA;&#x4E8E;SaaS&#x6216;&#x8005;&#x79C1;&#x6709;&#x5316;&#x90E8;&#x7F72;&#x7684;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x3002;&#x56FD;&#x5185;&#x7684;&#x6BD4;&#x5982;&#xFF1A;GrowingIO&#xFF0C;&#x795E;&#x7B56;&#x4EE5;&#x53CA;&#x5B57;&#x8282;&#x8DF3;&#x52A8;&#x706B;&#x5C71;&#x5F15;&#x64CE;&#x7684;DataFinder&#xFF1B;&#x56FD;&#x5916;&#x7684;&#x6BD4;&#x5982;&#xFF1A;Mixpanel&#x3002;&#x867D;&#x7136;Google Analytics&#x548C;Firebase Analytics&#x662F;&#x6765;&#x81EA;&#x4E8E;&#x5DE8;&#x5934;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x4F46;&#x5176;&#x5B9E;&#x505A;&#x7684;&#x4E0D;&#x592A;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x4E0D;&#x592A;&#x63A8;&#x8350;&#x3002;</p>
<h3 id="&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;">&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;</h3>
<p>&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5E76;&#x6CA1;&#x6709;&#x7EDF;&#x4E00;&#x7684;&#x547D;&#x540D;&#xFF0C;&#x6709;&#x4E9B;&#x79F0;&#x4E4B;&#x4E3A;<strong>&#x4E8B;&#x4EF6;&#x6A21;&#x578B;</strong>&#xFF0C;&#x6709;&#x4E9B;&#x79F0;&#x4E4B;&#x4E3A;<strong>&#x4E8B;&#x4EF6;-&#x7528;&#x6237;&#x6A21;&#x578B;</strong>&#x3002;&#x4F46;&#x6838;&#x5FC3;&#x8981;&#x7D20;&#x5C31;&#x662F;<strong>&#x7528;&#x6237;&#xFF08;User&#xFF09;</strong>&#x548C;<strong>&#x4E8B;&#x4EF6;&#xFF08;Event&#xFF09;</strong>&#x3002;&#x5BF9;&#x5E94;&#x7740;&#x57FA;&#x4E8E;<strong>&#x7528;&#x6237;</strong>&#x6807;&#x8BC6;&#x7684;&#x884C;&#x4E3A;<strong>&#x4E8B;&#x4EF6;</strong>&#x57CB;&#x70B9;&#x4E0A;&#x62A5;&#xFF0C;&#x4EE5;&#x53CA;&#x6700;&#x7EC8;&#x5206;&#x6790;&#x6027;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B58;&#x50A8;&#x7684;<strong>&#x4E8B;&#x4EF6;&#x5BBD;&#x8868;</strong>&#x548C;<strong>&#x7528;&#x6237;&#x5BBD;&#x8868;</strong>&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E5F;&#x51B3;&#x5B9A;&#x4E86;&#x6700;&#x7EC8;&#x7684;&#x6570;&#x636E;&#x5206;&#x6790;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x56F4;&#x7ED5;&#x7740;<strong>&#x7528;&#x6237;</strong>&#x548C;<strong>&#x4E8B;&#x4EF6;</strong>&#x5C55;&#x5F00;&#x7684;&#x3002;</p>
<p>&#x663E;&#x7136;&#x7684;&#xFF0C;&#x5C31;&#x50CF;&#x4E00;&#x53E5;&#x5B8C;&#x6574;&#x7684;&#x8BDD;&#x662F;&#x7531;<strong>&#x4E3B;-&#x8C13;-&#x5BBE;</strong>&#x6784;&#x6210;&#x7684;&#xFF0C;<strong>&#x7528;&#x6237;</strong>&#x4EA7;&#x751F;&#x7684;&#x884C;&#x4E3A;<strong>&#x4E8B;&#x4EF6;</strong>&#x5FC5;&#x7136;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x5C06;&#x5176;&#x79F0;&#x4E4B;&#x4E3A;<strong>&#x7269;&#x54C1;&#xFF08;Item&#xFF09;</strong>&#x3002;&#x65E9;&#x671F;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x5E76;&#x672A;&#x592A;&#x5173;&#x6CE8;<strong>&#x7269;&#x54C1;&#xFF08;Item&#xFF09;</strong>&#x3002;&#x5BFC;&#x81F4;<strong>&#x7269;&#x54C1;</strong>&#x76F8;&#x5173;&#x7684;&#x7EF4;&#x5EA6;&#x5206;&#x6790;&#x5B58;&#x5728;&#x7F3A;&#x5931;&#x3002;&#x4F46;&#x968F;&#x7740;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x4E0D;&#x65AD;&#x7684;&#x53D1;&#x5C55;&#x5B8C;&#x5584;&#xFF0C;<strong>&#x7269;&#x54C1;&#xFF08;Item&#xFF09;</strong>&#x4E5F;&#x88AB;&#x7EB3;&#x5165;&#x5176;&#x4E2D;&#xFF0C;&#x6210;&#x4E3A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x91CD;&#x8981;&#x8865;&#x5145;&#x3002;&#x5728;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x4E2D;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x7684;&#x662F;&#x76F8;&#x5173;&#x7684;<strong>&#x7269;&#x54C1;&#xFF08;Item&#xFF09;&#x7EF4;&#x5EA6;&#x8868;</strong>&#x3002;</p>
<p>&#x76EE;&#x524D;&#xFF0C;&#x4E00;&#x4E2A;&#x5B8C;&#x5584;&#x7684;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5C31;&#x662F;&#x7531;&#xFF1A;<strong>&#x7528;&#x6237;&#xFF08;User&#xFF09;-- &#x4E8B;&#x4EF6;&#xFF08;Event&#xFF09;-- &#x7269;&#x54C1;&#xFF08;Item&#xFF09;</strong>&#xFF0C;&#x8FD9;&#x4E09;&#x4E2A;&#x6838;&#x5FC3;&#x8981;&#x7D20;&#x7EC4;&#x6210;&#x3002;&#x968F;&#x7740;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x4E8B;&#x4EF6;&#x7684;&#x4E0A;&#x62A5;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x901F;&#x7684;&#x5C06;&#x4E0A;&#x62A5;&#x4E8B;&#x4EF6;&#x6570;&#x636E;&#x89E3;&#x6790;&#x4E3A;&#x5BF9;&#x5E94;&#x7684;<strong>&#x4E8B;&#x4EF6;&#x8868;</strong>&#x3001;<strong>&#x7528;&#x6237;&#x8868;</strong>&#x4EE5;&#x53CA;<strong>&#x7269;&#x54C1;&#x7EF4;&#x5EA6;&#x8868;</strong>&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x4F9B;&#x4E0B;&#x6E38;&#x6570;&#x636E;&#x5206;&#x6790;&#x4F7F;&#x7528;&#x3002;&#x540C;&#x65F6;&#xFF0C;<strong>&#x7528;&#x6237;&#x8868;</strong>&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#x5B57;&#x6BB5;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;<strong>&#x7269;&#x54C1;&#x7EF4;&#x5EA6;&#x8868;</strong>&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E13;&#x95E8;&#x7684;&#x540C;&#x6B65;&#x673A;&#x5236;&#xFF0C;&#x4ECE;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x540C;&#x6B65;&#x76F8;&#x5E94;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6BD4;&#x5982;&#x7528;&#x6237;&#x7B49;&#x7EA7;&#x8868;&#xFF0C;&#x5546;&#x54C1;&#x4FE1;&#x606F;&#x8868;&#xFF0C;&#x5E16;&#x5B50;&#x72B6;&#x6001;&#x8868;&#x7B49;&#x7B49;&#x3002;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x901A;&#x5E38;&#x7531;&#x4E00;&#x5F20;<strong>&#x4E8B;&#x4EF6;&#x8868;</strong>&#x3001;&#x4E00;&#x5F20;<strong>&#x7528;&#x6237;&#x8868;</strong>&#x548C;N&#x5F20;<strong>&#x7269;&#x54C1;&#x7EF4;&#x5EA6;&#x8868;</strong>&#x7EC4;&#x6210;&#x3002;</p>
<p>&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x6570;&#x636E;&#x4E0A;&#x62A5;&#x4E00;&#x822C;&#x91C7;&#x7528;<code>json</code>&#x683C;&#x5F0F;&#xFF0C;&#x4E00;&#x6761;&#x5178;&#x578B;&#x7684;&#x6570;&#x636E;&#x4E0A;&#x62A5;&#x683C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;<code>event_name</code>&#x4E3A;&#x4E8B;&#x4EF6;&#x540D;&#x79F0;&#xFF0C;<code>local_time_ms</code>&#x4E3A;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x95F4;&#xFF1B;<code>user</code>&#x4E3A;&#x89E6;&#x53D1;&#x4E8B;&#x4EF6;&#x7684;&#x7528;&#x6237;&#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x7684;&#x7528;&#x6237;&#x4FE1;&#x606F;&#xFF0C;&#x7528;&#x4E8E;&#x5173;&#x8054;&#x7528;&#x6237;&#x8868;&#xFF1B;<code>params</code>&#x4E3A;&#x4E8B;&#x4EF6;&#x5305;&#x542B;&#x7684;&#x5C5E;&#x6027;&#x4FE1;&#x606F;&#xFF1B;<code>item</code>&#x4E3A;&#x4E0E;&#x4E8B;&#x4EF6;&#x76F8;&#x5173;&#x7684;&#x7269;&#x54C1;&#x4FE1;&#x606F;&#xFF0C;&#x7528;&#x4E8E;&#x5173;&#x8054;&#x7269;&#x54C1;&#xFF08;Item&#xFF09;&#x7EF4;&#x5EA6;&#x8868;&#x3002;</p>
<pre class="language-"><code class="lang-json"><span class="token punctuation">{</span>
    <span class="token property">&quot;user&quot;</span><span class="token operator">:</span> <span class="token punctuation">{</span>
        <span class="token property">&quot;user_id&quot;</span><span class="token operator">:</span> <span class="token string">&quot;0001&quot;</span><span class="token punctuation">,</span>      
        <span class="token property">&quot;device_id&quot;</span><span class="token operator">:</span> <span class="token string">&quot;asdf123&quot;</span><span class="token punctuation">,</span>            
        <span class="token property">&quot;app_version&quot;</span><span class="token operator">:</span> <span class="token string">&quot;9.13.5&quot;</span><span class="token punctuation">,</span>
        <span class="token property">&quot;network_type&quot;</span><span class="token operator">:</span> <span class="token string">&quot;wifi&quot;</span><span class="token punctuation">,</span>
        <span class="token property">&quot;platform&quot;</span><span class="token operator">:</span> <span class="token string">&quot;Android&quot;</span>
    <span class="token punctuation">}</span><span class="token punctuation">,</span>
    <span class="token property">&quot;params&quot;</span><span class="token operator">:</span> <span class="token punctuation">{</span>
                <span class="token property">&quot;author_id&quot;</span><span class="token operator">:</span> <span class="token string">&quot;809654&quot;</span><span class="token punctuation">,</span>
                <span class="token property">&quot;article_type&quot;</span><span class="token operator">:</span> <span class="token string">&quot;video&quot;</span><span class="token punctuation">,</span>
          <span class="token property">&quot;view_list&quot;</span><span class="token operator">:</span> <span class="token string">&quot;main&quot;</span>
    <span class="token punctuation">}</span><span class="token punctuation">,</span>
    <span class="token property">&quot;items&quot;</span><span class="token operator">:</span><span class="token punctuation">{</span>
        <span class="token property">&quot;article&quot;</span><span class="token operator">:</span> <span class="token punctuation">[</span><span class="token punctuation">{</span>
            <span class="token property">&quot;id&quot;</span><span class="token operator">:</span> <span class="token string">&quot;789&quot;</span>
        <span class="token punctuation">}</span><span class="token punctuation">]</span>
    <span class="token punctuation">}</span><span class="token punctuation">,</span>
    <span class="token property">&quot;event_name&quot;</span><span class="token operator">:</span> <span class="token string">&quot;like_article&quot;</span><span class="token punctuation">,</span>
    <span class="token property">&quot;app_id&quot;</span><span class="token operator">:</span> <span class="token string">&quot;4567&quot;</span><span class="token punctuation">,</span>
    <span class="token property">&quot;app_name&quot;</span><span class="token operator">:</span> <span class="token string">&quot;buybuy&quot;</span><span class="token punctuation">,</span>
    <span class="token property">&quot;local_time_ms&quot;</span><span class="token operator">:</span> <span class="token number">1671593592638</span>
<span class="token punctuation">}</span>
</code></pre>
<p>&#x4EE5;&#x4E0A;&#x793A;&#x4F8B;&#x4E3A;&#x4E00;&#x6761;&#x7ED9;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#x70B9;&#x8D5E;&#x7684;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x6570;&#x636E;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x6761;&#x6570;&#x636E;&#x4E0A;&#x62A5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x591A;&#x7EF4;&#x5EA6;&#x7684;&#x5206;&#x6790;&#x201D;&#x5185;&#x5BB9;&#x70B9;&#x8D5E;&#x201C;&#x8FD9;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x4E0D;&#x540C;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x4E0B;&#x7ED9;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#x7684;&#x70B9;&#x8D5E;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;&#x4E0D;&#x540C;&#x5185;&#x5BB9;&#x7C7B;&#x578B;&#x7684;&#x70B9;&#x8D5E;&#x60C5;&#x51B5;&#x7B49;&#x7B49;&#x3002;&#x4F46;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x8981;&#x5206;&#x6790;&#x5185;&#x5BB9;&#x7684;&#x70B9;&#x8D5E;&#x603B;&#x91CF;&#x6216;&#x8005;&#x6211;&#x4EEC;&#x60F3;&#x5206;&#x6790;&#x5E16;&#x5B50;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#xFF08;&#x5BA1;&#x6838;&#x662F;&#x5426;&#x901A;&#x8FC7;&#xFF09;&#xFF0C;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x884C;&#x4E3A;&#x6570;&#x636E;&#x7684;&#x4E0A;&#x62A5;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x5C31;&#x8981;&#x5173;&#x8054;&#x7269;&#x54C1;&#x7EF4;&#x5EA6;&#x8868;&#x4E2D;&#x76F8;&#x5173;&#x7684;&#x5185;&#x5BB9;&#x5C5E;&#x6027;&#x3002;</p>
<h3 id="&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;">&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;</h3>
<p>&#x4E0B;&#x56FE;&#x5C55;&#x793A;&#x7684;&#x662F;&#x795E;&#x7B56;&#x7684;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#xFF0C;&#x4EE5;&#x6B64;&#x4E3A;&#x4F8B;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x6574;&#x4F53;&#x6280;&#x672F;&#x67B6;&#x6784;&#x5927;&#x81F4;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;</p>
<ol>
<li>&#x6570;&#x636E;&#x91C7;&#x96C6;&#x5B50;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x5757;&#x513F;&#x4EE5;&#x524D;&#x7AEF;&#x540E;&#x7AEF;&#x7684;&#x6570;&#x636E;&#x91C7;&#x96C6;SDK&#x4E3A;&#x4E3B;&#xFF0C;&#x7528;&#x6765;&#x63D0;&#x4F9B;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x6570;&#x636E;&#x7684;&#x91C7;&#x96C6;&#x529F;&#x80FD;&#x548C;&#x4E0A;&#x62A5;&#x529F;&#x80FD;&#x3002;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x5929;&#x7136;&#x5305;&#x542B;&#x4E86;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x6A21;&#x5757;&#x513F;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x6709;&#x540C;&#x5B66;&#x76F4;&#x63A5;&#x628A;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x53EB;&#x505A;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x5DE5;&#x5177;&#x3002;</li>
<li>&#x6570;&#x636E;&#x63A5;&#x5165;&#x5B50;&#x6A21;&#x5757;&#x3002;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x6570;&#x636E;&#x901A;&#x8FC7;Http&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x4E0A;&#x62A5;&#xFF0C;&#x7531;Nginx&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x63A5;&#x6536;&#x7AEF;&#x5C06;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x6570;&#x636E;&#x5199;&#x5165;&#x65E5;&#x5FD7;&#x3002;&#x7528;Flume&#x6216;&#x8005;Logstash&#x8FD9;&#x7C7B;&#x5DE5;&#x5177;&#x4ECE;&#x65E5;&#x5FD7;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5E76;&#x5199;&#x5165;&#x6D88;&#x606F;&#x961F;&#x5217;Kafka&#xFF0C;&#x4F9B;&#x4E0B;&#x6E38;&#x8BFB;&#x53D6;&#x5E76;&#x5904;&#x7406;&#x3002;</li>
<li>&#x6570;&#x636E;&#x5BFC;&#x5165;&#x4E0E;&#x5B58;&#x50A8;&#x6A21;&#x5757;&#x3002;Spark&#x6216;&#x8005;Flink&#x4ECE;Kafka&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x8FDB;&#x884C;ETL&#x4E4B;&#x540E;&#x5199;&#x5165;&#x5B58;&#x50A8;&#x3002;&#x795E;&#x7B56;&#x7684;OLAP&#x6A21;&#x5757;&#x4F7F;&#x7528;&#x7684;&#x662F;Parquet+Kudu+Impala&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5B58;&#x50A8;&#x548C;&#x67E5;&#x8BE2;&#x5206;&#x79BB;&#x3002;GrowingIO&#x65E9;&#x671F;&#x662F;&#x4F7F;&#x7528;HBase&#x81EA;&#x7814;&#x4E86;&#x4E00;&#x5957;OLAP&#x5F15;&#x64CE;&#xFF0C;&#x540E;&#x9762;&#x91CD;&#x6784;&#x4E4B;&#x540E;&#x91C7;&#x7528;&#x7684;&#x662F;ClickHouse&#x3002;&#x5B57;&#x8282;&#x706B;&#x5C71;&#x5F15;&#x64CE;&#x7684;DataFinder&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x81EA;&#x7814;&#x7684;ByteHouse&#x4F5C;&#x4E3A;OLAP&#x5F15;&#x64CE;&#xFF0C;ByteHouse&#x662F;&#x57FA;&#x4E8E;ClickHouse&#x7684;&#x9B54;&#x6539;&#x7248;&#x672C;&#x3002;</li>
<li>&#x6700;&#x540E;&#x5C31;&#x662F;&#x5404;&#x79CD;&#x6570;&#x636E;&#x5E94;&#x7528;&#x6A21;&#x5757;&#x3002;&#x5305;&#x62EC;&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x5206;&#x6790;&#xFF0C;&#x667A;&#x80FD;&#x8FD0;&#x8425;&#x7B49;&#x7B49;&#x3002;</li>
</ol>
<p>&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x6452;&#x5F03;&#x4E86;&#x4F20;&#x7EDF;&#x6570;&#x4ED3;&#x7684;&#x591A;&#x5C42;&#x5206;&#x5C42;&#x67B6;&#x6784;&#xFF0C;&#x6570;&#x636E;&#x63A5;&#x5165;&#x4E4B;&#x540E;&#x4EE5;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#x8FDB;&#x5165;OLAP&#x5B58;&#x50A8;&#x6210;&#x5927;&#x5BBD;&#x8868;&#x3002;&#x63D0;&#x5347;&#x6570;&#x636E;&#x5B9E;&#x65F6;&#x6027;&#x7684;&#x540C;&#x65F6;&#x4E5F;&#x964D;&#x4F4E;&#x4E86;&#x4E2D;&#x95F4;&#x73AF;&#x8282;&#x51FA;&#x9519;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x5C3D;&#x91CF;&#x63D0;&#x5347;&#x6570;&#x636E;&#x8D28;&#x91CF;&#x3002;</p>
<p><img src="pics/UserBehaviorsAnalysisPlatform/UBAArchitecture.png" alt="image-20221221175851639" style="zoom:80%;"></p>
<h3 id="&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x6570;&#x636E;&#x80FD;&#x529B;">&#x7528;&#x6237;&#x884C;&#x4E3A;&#x5206;&#x6790;&#x5E73;&#x53F0;&#x7684;&#x6570;&#x636E;&#x80FD;&#x529B;</h3>
<div id="gitalk-container"></div>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="DimensionalModeling.html" class="navigation navigation-prev " aria-label="Previous page: 维度建模">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="SQLKeypoints.html" class="navigation navigation-next " aria-label="Next page: SQL要点">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"用户行为分析平台","level":"1.9","depth":1,"next":{"title":"SQL要点","level":"1.10","depth":1,"path":"SQLKeypoints.md","ref":"SQLKeypoints.md","articles":[]},"previous":{"title":"维度建模","level":"1.8","depth":1,"path":"DimensionalModeling.md","ref":"DimensionalModeling.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","search-pro","-code","-codeline","-highlight","prism","expandable-chapters","chapter-fold","splitter","back-to-top-button","advanced-emoji","hide-element","insert-logo","custom-favicon","pageview-count","-sharing","sharing-plus","flexible-alerts","katex-new","mygitalk","theme-comscore","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"chapter-fold":{},"prism":{},"katex-new":{},"livereload":{},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"favicon":"pics/logo.ico","theme-comscore":{},"back-to-top-button":{},"pageview-count":{},"custom-favicon":{},"flexible-alerts":{"style":"callout","note":{"label":"Note","icon":"fa fa-info-circle","className":"info"},"tip":{"label":"Tip","icon":"fa fa-lightbulb-o","className":"tip"},"warning":{"label":"Warning","icon":"fa fa-exclamation-triangle","className":"warning"},"danger":{"label":"Attention","icon":"fa fa-ban","className":"danger"}},"mygitalk":{"flipMoveOptions":{},"clientID":"c623ce11cb38fa65e5f0","number":-1,"perPage":10,"proxy":"https://cors-anywhere.azm.workers.dev/https://github.com/login/oauth/access_token","admin":["powerAmore"],"createIssueManually":false,"distractionFreeMode":false,"repo":"DataSciChecklist","owner":"powerAmore","enableHotKey":true,"clientSecret":"09a234dcf2ca63822ea9858aa00245147624e61d","pagerDirection":"last","labels":["Gitalk"]},"advanced-emoji":{"embedEmojis":false},"sharing":{"facebook":true,"twitter":true,"all":["douban","facebook","google","twitter","weibo","qq","whatsapp"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"insert-logo":{"url":"pics/logo.jpeg","style":"background: none; max-height: 30px; min-height: 30px"},"expandable-chapters":{}},"theme":"default","author":"powerlee","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"大数据技术与算法Checklist","language":"zh-hans","links":{},"gitbook":"*","description":"大数据技术与算法Checklist"},"file":{"path":"UserBehaviorsAnalysisPlatform.md","mtime":"2022-12-21T13:10:09.246Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-12-21T13:11:20.470Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-insert-logo/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-flexible-alerts/plugin.js"></script>
        
    
        
        <script src="https://cdn.bootcss.com/blueimp-md5/2.12.0/js/md5.min.js"></script>
        
    
        
        <script src="https://unpkg.com/gitalk/dist/gitalk.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mygitalk/mygitalk.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

